# pandas dataframe

In [1]:
import pandas

In [2]:
dataFrame = pandas.DataFrame([[22, 26, 12], [1, 11, 7]])

In [4]:
dataFrame

    0   1   2
0  22  26  12
1   1  11   7

In [5]:
dataFrame = pandas.DataFrame([[22, 26, 12], [1, 11, 7]],columns=["date1","date2","date3"])

In [6]:
dataFrame

   date1  date2  date3
0     22     26     12
1      1     11      7

In [7]:
dataFrame = pandas.DataFrame([[22, 26, 12], [1, 11, 7]], columns=["date1", "date2", "date3"], index=["day1", "day2"])

In [8]:
dataFrame

      date1  date2  date3
day1     22     26     12
day2      1     11      7

In [13]:
dataFrame2 = pandas.DataFrame([{"firstname": "rom", "lastname": "pilapil"}, {"firstname": "meann", "lastname": "natividad"}])

In [14]:
dataFrame2

  firstname   lastname
0       rom    pilapil
1     meann  natividad

In [15]:
dataFrame.mean()

date1    11.5
date2    18.5
date3     9.5
dtype: float64

In [16]:
dataFrame.mean().mean()

13.166666666666666

In [17]:
dataFrame.date1

day1    22
day2     1
Name: date1, dtype: int64

In [18]:
dataFrame.date3

day1    12
day2     7
Name: date3, dtype: int64

In [19]:
dataFrame.date3.mean()

9.5

In [20]:
dataFrame.date1.max()

22